#### Import packages

In [2]:
import pandas as pd
import plotly.express as px

#### Load Dataset

In [10]:
# dont forget the .csv
# the file name is `Top 200 Highest Grossing Movies.csv`
# you can keep the ./
movies_dataframe = pd.read_csv('Top 200 Highest Grossing Movies.csv')

#### Data Cleaning

In [11]:
movies_dataframe.head()

   Rank                                       Title   Lifetime Gross  Year
0     1                                      Avatar  $2,847,397,339   2009
1     2                           Avengers: Endgame  $2,797,501,328   2019
2     3                                     Titanic  $2,201,647,264   1997
3     4  Star Wars: Episode VII - The Force Awakens  $2,069,521,700   2015
4     5                      Avengers: Infinity War  $2,048,359,754   2018

In [13]:
movies_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Rank            200 non-null    int64
 1   Title           200 non-null    object
 2   Lifetime Gross  200 non-null    object
 3   Year            200 non-null    int64
dtypes: int64(2), object(2)
memory usage: 6.4+ KB

In [14]:
movies_dataframe.tail()

     Rank                               Title Lifetime Gross  Year
195   196               Detective Chinatown 2  $544,185,156   2018
196   197                   X-Men: Apocalypse  $543,934,105   2016
197   198  Sherlock Holmes: A Game of Shadows  $543,848,418   2011
198   199                       Despicable Me  $543,157,985   2010
199   200                          Cinderella  $542,358,331   2015

In [15]:
movies_dataframe.dropna()

     Rank                                       Title   Lifetime Gross  Year
0       1                                      Avatar  $2,847,397,339   2009
1       2                           Avengers: Endgame  $2,797,501,328   2019
2       3                                     Titanic  $2,201,647,264   1997
3       4  Star Wars: Episode VII - The Force Awakens  $2,069,521,700   2015
4       5                      Avengers: Infinity War  $2,048,359,754   2018
..    ...                                         ...              ...   ...
195   196                       Detective Chinatown 2    $544,185,156   2018
196   197                           X-Men: Apocalypse    $543,934,105   2016
197   198          Sherlock Holmes: A Game of Shadows    $543,848,418   2011
198   199                               Despicable Me    $543,157,985   2010
199   200                                  Cinderella    $542,358,331   2015

[200 rows x 4 columns]

#### Exploratory Data Analysis